app/views/victim/home.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1
---

<% current_user.posts.each do |post| %>