app/controllers/posts_controller.rb

  def index
  if params[:search].present?
    @posts = Post.near(params[:search], 50, :order => :distance)
  else
    @posts = Post.all(:order => "created_at DESC")
---
SELECT posts.*, (69.09332411348201 * ABS(posts.latitude - 30.1588129) * 0.7071067811865475) + (59.836573914187355 * ABS(posts.longitude - -85.6602058) * 0.7071067811865475) AS distance, CASE WHEN (posts.latitude >= 30.1588129 AND posts.longitude >= -85.6602058) THEN 45.0 WHEN (posts.latitude < 30.1588129 AND posts.longitude >= -85.6602058) THEN 135.0 WHEN (posts.latitude < 30.1588129 AND posts.longitude < -85.6602058) THEN 225.0 WHEN (posts.latitude >= 30.1588129 AND posts.longitude < -85.6602058) THEN 315.0 END AS bearing FROM "posts" WHERE (posts.latitude BETWEEN 29.724617550667457 AND 30.593008249332545 AND posts.longitude BETWEEN -86.16237695823689 AND -85.15803464176311 AND posts.id != 9) ORDER BY distance ASC

  def create
    @post = Post.new(params[:post])
    @post.user_id = current_user.id
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("city", "created_at", "crime", "details", "image_content_type", "image_file_name", "image_file_size", "latitude", "longitude", "state", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "21"]]
UPDATE "posts" SET "state" = 'AL', "image_file_name" = 'ender.jpg', "image_content_type" = 'image/jpeg', "image_file_size" = 79185, "latitude" = 31.756711, "longitude" = 35.162002, "updated_at" = '2013-01-08 21:25:39.673708' WHERE "posts"."id" = 28