app/controllers/tips_controller.rb

  def show
    @tip = Tip.find(params[:id])
---
SELECT "tips".* FROM "tips" WHERE "tips"."id" = ? LIMIT 1  [["id", "12"]]

  def create
    post_id = params[:tip].delete(:post_id)
    @tip = Tip.new(params[:tip])
    @tip.post_id = post_id

    respond_to do |format|
      if @tip.save
---
INSERT INTO "tips" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "This is another test tip!"], ["created_at", Mon, 07 Jan 2013 16:23:24 UTC +00:00], ["post_id", 19], ["updated_at", Mon, 07 Jan 2013 16:23:24 UTC +00:00]]